src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <basedOn>Document.Заказ</basedOn>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Резервы</registerRecords>
  <attributes>
    <name>Выдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Принял</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЕдиницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупочнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.Резервы</registerRecords>
  <attributes>
    <name>ФИО_клиента</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолучения</name>
    <type>
      <types>EnumRef.СпособПолученияЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СдачаДляКурьеров</name>
    <type>
      <types>EnumRef.Сдача</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЕдиницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакупочнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОплаты</name>
      <type>
        <types>EnumRef.СпособОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сдача</name>
      <type>
        <types>EnumRef.Сдача</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РеализацияТоваров/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДобавитьИзСпискаЗадачНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьИзСпискаЗадачНаСервере()
	
	//СоздатьТаблицуЗначений(ТЗ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК Ссылка,
	|	Заказ.Номер КАК Номер,
	|	Заказ.ФИО_клиента КАК ФИО_клиента,
	|	Заказ.ИтоговаяСумма КАК ИтоговаяСумма,
	|	Заказ.Телефон КАК Телефон,
	|	Заказ.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество
	|	) КАК Товары
	|ИЗ
	|	Документ.Заказ КАК Заказ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = Таблица.Добавить();
		Строка.Номер = Выборка.Номер;
	

		Строка.Сдача = Выборка.Сдача;
		Строка.Сумма = Выборка.ИтоговаяСумма;
		Строка.Галка = ложь;
	КонецЦикла;
	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ПодтвердитьВыбор(Команда)
	//Ключ = ПолучитьИзВременногоХранилища(ЭтотОбъект.ФормаДокумента.АдресВХранилище);
		ФормаДока = ПолучитьФорму("Документ.МаршрутныйЛист.Форма.ФормаДокумента");
	Для Каждого Строка Из Таблица Цикл
		Если Строка.Галка = Истина тогда
			НоваяСтрока = ФормаДока.Объект.СписокЗадач.Добавить();	
			НоваяСтрока.Время = Строка.Дата;
			НоваяСтрока.Адрес =  Строка.Адрес;
			//НоваяСтрока.Клиент = Задача.ФИО_клиента1;
			НоваяСтрока.Сдача =  Строка.Сдача;
			//НоваяСтрока.СпособОплаты =  Задача.СпособОплаты;
			НоваяСтрока.Сумма = Строка.Сумма;
		КонецЕсли;
	КонецЦикла;
	

	ЭтаФорма.Закрыть();
	ФормаДока.Открыть();
КонецПроцедуры
